#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-q7socMnuZHXn6fpP

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate: Refreshing state... [id=prod/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=prod/elasticsearch-credentials]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.module.monitoring.kubernetes_namespace.logging: Refreshing state... [id=logging]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=prod/application-secret]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=prod/api]
module.infrastructure.kubernetes_ingress.prod_ingress: Refreshing state... [id=prod/foreign-language-reader-ingress]
module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=126962116]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.aws_iam_access_key.github will be created
  + resource "aws_iam_access_key" "github" {
      + encrypted_secret     = (known after apply)
      + id                   = (known after apply)
      + key_fingerprint      = (known after apply)
      + secret               = (sensitive value)
      + ses_smtp_password_v4 = (sensitive value)
      + status               = (known after apply)
      + user                 = "foreign-language-reader-github"
    }

  # module.infrastructure.aws_iam_user.github will be created
  + resource "aws_iam_user" "github" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "foreign-language-reader-github"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # module.infrastructure.module.content.aws_s3_bucket.definitions will be created
  + resource "aws_s3_bucket" "definitions" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "foreign-language-reader-definitions"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.infrastructure.module.frontend.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "www.foreignlanguagereader.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "www.foreignlanguagereader.com"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "www.foreignlanguagereader.com"
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:037187302622:certificate/23bf2e3d-1934-4470-a27d-05f3847a5ef2"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.frontend.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to www.foreignlanguagereader.com"
      + id          = (known after apply)
      + name        = "www.foreignlanguagereader.com-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "www.foreignlanguagereader.com-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

  # module.infrastructure.module.frontend.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "www.foreignlanguagereader.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access will be created
  + resource "aws_s3_bucket_policy" "public_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.frontend.digitalocean_record.subdomain will be created
  + resource "digitalocean_record" "subdomain" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = (known after apply)
    }

  # module.infrastructure.module.storybook.data.aws_iam_policy_document.deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deploy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.infrastructure.module.storybook.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + aliases                        = [
          + "storybook.foreignlanguagereader.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "storybook.foreignlanguagereader.com"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = true

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "storybook.foreignlanguagereader.com"
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:037187302622:certificate/23bf2e3d-1934-4470-a27d-05f3847a5ef2"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.infrastructure.module.storybook.aws_iam_policy.deploy will be created
  + resource "aws_iam_policy" "deploy" {
      + arn         = (known after apply)
      + description = "IAM policy for deploying to storybook.foreignlanguagereader.com"
      + id          = (known after apply)
      + name        = "storybook.foreignlanguagereader.com-deploy-role"
      + path        = "/"
      + policy      = (known after apply)
    }

  # module.infrastructure.module.storybook.aws_iam_policy_attachment.deploy will be created
  + resource "aws_iam_policy_attachment" "deploy" {
      + id         = (known after apply)
      + name       = "storybook.foreignlanguagereader.com-deploy-role-attach"
      + policy_arn = (known after apply)
      + users      = [
          + "foreign-language-reader-github",
        ]
    }

  # module.infrastructure.module.storybook.aws_s3_bucket.main will be created
  + resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "storybook.foreignlanguagereader.com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.infrastructure.module.storybook.aws_s3_bucket_policy.public_access will be created
  + resource "aws_s3_bucket_policy" "public_access" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.infrastructure.module.storybook.digitalocean_record.subdomain will be created
  + resource "digitalocean_record" "subdomain" {
      + domain = "foreignlanguagereader.com"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "storybook"
      + ttl    = (known after apply)
      + type   = "CNAME"
      + value  = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
